app/controllers/school_classes_controller.rb

    def index
        @klasses = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def show
        @klass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @klass = SchoolClass.create(klass_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 418], ["created_at", "2019-12-06 19:34:42.652281"], ["updated_at", "2019-12-06 19:34:42.652281"]]

    def edit
        @klass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @klass = SchoolClass.find(params[:id])
        @klass.update(klass_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 481], ["updated_at", "2019-12-06 19:37:15.005293"], ["id", 1]]