app/controllers/students_controller.rb

    def index
        @students = Student.all
---
SELECT "students".* FROM "students"

    def show
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jacques"], ["last_name", "Plante"], ["created_at", "2019-12-06 19:29:42.366474"], ["updated_at", "2019-12-06 19:29:42.366474"]]

    def edit
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        @student = Student.find(params[:id])
        @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jac"], ["updated_at", "2019-12-06 19:30:04.910104"], ["id", 3]]